Repository: turulomio/toomanyfiles
Catalog: toomanyfiles/locale/*.po
Languages: es

source: DESCRIPTION
es: DESCRIPCIÓN

source: Remove innecesary files or directories with a date and time pattern in the current directory.
es: Borra ficheros o directorios innecesarios, que tengan un patrón de fecha y hora en el directorio actual.

source: This app has the following mandatory parameters:
es: Esta aplicación tiene los siguientes parámetros obligatorios

source: Create two directories called 'example' and 'example_directories' in the current working directory and fill it with example files with date and time patterns.
es: Crea dos directorios de nombre 'example' y 'example_directories' en el directorio actual y los llena con ficheros de ejemplo que tengan patrónes de fecha y hora.

source: Makes a simulation selecting which files will be deleted when --remove parameter is used.
es: Realiza una simulación seleccionando que ficheros serán borrados cuando se use el parámetro --remove.

source: Deletes files. Be careful, This can't be unmade. Use --pretend before.
es: Borra los ficheros. Ten cuidado, esto no puede deshacerse. Usa antes --pretend.

source: With --pretend and --remove you can use this parameters:
es: Con --pretend y --remove puedes usar estos parámetros

source: Sets the date and time pattern to search in the current directory filenames. It uses python strftime function format.
es: Establece el patrón de fecha y hora para buscar en los nombres del directorio actual. Usa el formato de python de la funciónde strftime

source: New Release:
es: Nueva versión:

source: R
es: P

source: D
es: B

source: Y
es: J

source: O
es: S

source: So, {} files will be deleted and {} will be kept when you use --remove parameter.
es: De esta manera, {} ficheros serán borrados y {} serán guardados cuando uses el parámetro --remove.

source: File status removing:
es: Estado de los ficheros para borrar:

source: So, {} files have been deleted and {} files have been kept.
es: De esta manera, {} ficheros se han borrado y {} ficheros se han guardado.

source: Remains
es: Permanece

source: Delete
es: Borrado

source: Too young to delete
es: Muy joven para borrar

source: Over max files
es: Supera el número de ficheros a guardar

source: Different examples have been created in the directory 'toomanyfiles_examples'
es: Se han creado varios ejemplos en el directorio 'toomanyfiles_examples'

source: 'toomanyfiles_examples' directory removed
es: El directorio 'toomanyfiles_examples' ha sido borrado

source: I can't remove 'toomanyfiles_examples' directory
es: No puedo borrar el directorio 'toomanyfiles_examples'

source: Directory
es: Directorio

source: File
es: Fichero

source: File patterns weren't found
es: No se encontro patrón en el nombre del fichero

source: Time pattern wasn't found
es: No se encontró patrón temporal

source: The number of files too young to delete can't be bigger than the maximum number of files to store
es: El número de ficheros demasiado recientes para ser borrados no puede ser mayor que el máximo número de ficheros a guardar

source: Not developed yet
es: No desarrollado todavía

source: Over max number of files
es: Supera el número de ficheros a guardar

source: Search date and time patterns to delete innecesary files or directories
es: Busca patrónes de fecha y hora para borrar ficheros o directorios innecesarios

source: Developed by Mariano Muñoz 2018-{}
es: Desarrollado por Mariano Muñoz 2018-{}

source: Create example directories
es: Crear directorios de ejemplo

source: Remove example directories'
es: Borrar directorios de ejemplo

source: Removes files permanently
es: Borra los ficheros permanentemente

source: Makes a simulation and doesn't remove files
es: Realiza una simulación y no borra los ficheros

source: List files included and excluded
es: Listado de ficheros incluídos y excluídos

source: Modifiers to use with --remove and --pretend
es: Parámetros a usar con --remove y --pretend

source: Defines a python datetime pattern to search in current directory. The default pattern is '%(default)s'.
es: Define un patrón de fecha y hora a buscar en el directorio actual. El patrón por defecto es '%(default)s'.

source: Disable log generation. The default value is '%(default)s'.
es: Desabilita la generación del registro. El valor por defecto es '%(default)s'.

source: Remove mode. The default value is '%(default)s'.
es: Modo de borrado. El valor por defecto es '%(default)s'.

source: Number of days to respect from today. The default value is '%(default)s'.
es: Número de días que se respetan desde hoy sin borrar. El valor por defecto es '%(default)s'.

source: Maximum number of files to remain in directory. The default value is '%(default)s'.
es: Máximo número de ficheros que quedarán en el directorio. El valor por defecto es '%(default)s'.

source: FILES TO PROCESS
es: FICHEROS A PROCESAR

source: FILES IGNORED
es: FICHEROS IGNORADOS

source: DIRECTORY
es: DIRECTORIO

source: FILE
es: FICHERO
